{
  "metadata": {
    "name": "Custom Control Framework",
    "version": "1.0",
    "organization_profile": "AWS SaaS, ~100 people, macOS endpoints, no physical datacenters",
    "last_updated": "2025-12-30"
  },
  "controls": {
    "ACC-01": {
      "id": "ACC-01",
      "category": "Access Control",
      "title": "Identity & Authentication",
      "description": "All access to systems requires authentication using WebAuthn/passkeys or SSO with MFA. Password-only authentication is not permitted for any production systems.",
      "objective": "Ensure all users are uniquely identified and authenticated using strong, phishing-resistant methods.",
      "implementation": [
        "**User Authentication**: Okta or Google Workspace for SSO with MFA required. WebAuthn/passkeys enforced for all users. AWS IAM Identity Center for cloud access.",
        "**No Passwords**: No service account passwords - use IAM roles or workload identity instead.",
        "**Access Methods**: SSO login for all SaaS tools. AWS access via SSO only (no long-lived credentials). GitHub protected by SSO + WebAuthn. API keys rotated every 90 days."
      ],
      "examples": [
        "All employees use Yubikeys for WebAuthn authentication",
        "AWS access requires SSO through Okta with MFA",
        "Password-only authentication disabled for all production systems",
        "Service accounts use IAM roles instead of credentials"
      ],
      "audit_evidence": [
        "SSO configuration showing MFA enforcement",
        "User directory with MFA enrollment status",
        "AWS IAM policy requiring SSO",
        "Access logs showing authentication methods"
      ],
      "mappings": {
        "SOC 2": ["CC6.1", "CC6.2", "CC6.3"],
        "GDPR": ["Art 32"]
      }
    },
    "ACC-02": {
      "id": "ACC-02",
      "category": "Access Control",
      "title": "Least Privilege & RBAC",
      "description": "Access to systems and data is granted based on job function using role-based access control. Users receive minimum necessary permissions. Production access requires additional approval.",
      "objective": "Minimize risk by ensuring users only have access needed for their role.",
      "implementation": [
        "**RBAC Model**: Define roles for Engineering, Support, Admin, etc. Map users to roles in identity provider.",
        "**AWS Access**: Use AWS SSO permission sets tied to job functions. No direct IAM user access. Separate read-only and admin roles.",
        "**Production Access**: Requires manager approval. Time-limited sessions using AWS SSO or just-in-time access tools.",
        "**Service Accounts**: Use AWS IAM roles with scoped policies. No broad wildcard permissions."
      ],
      "examples": [
        "Engineers have read-only production access by default",
        "Admin access to production requires manager approval and expires after 8 hours",
        "AWS IAM roles follow principle of least privilege with no wildcard (*) permissions",
        "Support team has limited read access to customer data based on support case"
      ],
      "audit_evidence": [
        "RBAC role definitions and mappings",
        "AWS IAM policies showing least privilege",
        "Production access approval logs",
        "Access review documentation"
      ],
      "mappings": {
        "SOC 2": ["CC6.1", "CC6.2", "CC6.3"],
        "GDPR": ["Art 32"]
      }
    },
    "ACC-03": {
      "id": "ACC-03",
      "category": "Access Control",
      "title": "Access Reviews",
      "description": "User access rights are reviewed quarterly. Terminated employees have access revoked immediately. Role changes trigger access recertification.",
      "objective": "Ensure access remains appropriate and remove unnecessary permissions.",
      "implementation": [
        "**Quarterly Reviews**: Managers review team access to AWS, GitHub, production systems. Document reviews in ticketing system.",
        "**Automated Reports**: Generate quarterly access reports from SSO and AWS IAM Identity Center showing user permissions.",
        "**Deprovisioning**: Automated employee offboarding removes all access within 1 hour of termination.",
        "**Role Changes**: Transfer or promotion triggers access review within 5 business days."
      ],
      "examples": [
        "Q1 2025 access review completed with all managers certifying team permissions",
        "SCIM integration automatically provisions/deprovisions users in Okta",
        "GitHub organization access reviewed quarterly with inactive members removed",
        "AWS access report shows no users with permissions exceeding their role"
      ],
      "audit_evidence": [
        "Quarterly access review records",
        "Manager approval documentation",
        "Deprovisioning logs",
        "Before/after snapshots of user permissions"
      ],
      "mappings": {
        "SOC 2": ["CC6.3"],
        "GDPR": ["Art 32"]
      }
    },
    "ACC-04": {
      "id": "ACC-04",
      "category": "Access Control",
      "title": "Privileged Access Management",
      "description": "Administrative and privileged access is tightly controlled, monitored, and audited. Break-glass procedures exist for emergency access.",
      "objective": "Protect critical systems through enhanced controls on privileged accounts.",
      "implementation": [
        "**Admin Accounts**: Separate admin accounts (admin@) from regular user accounts. MFA required for all admin access.",
        "**AWS Root Account**: Root account MFA enabled with hardware token. Root credentials stored in physical safe. Access requires two executives.",
        "**Session Recording**: All privileged sessions recorded using AWS CloudTrail and CloudWatch Logs.",
        "**Break Glass**: Emergency access procedures documented. Break-glass account usage triggers alert to security team and CEO."
      ],
      "examples": [
        "AWS root account credentials locked in company safe, requires CEO + CFO",
        "All admin actions logged to immutable S3 bucket with CloudTrail",
        "Engineers use elevated privileges via AWS SSO with automatic 4-hour timeout",
        "Break-glass account last used 6 months ago during critical outage, fully documented"
      ],
      "audit_evidence": [
        "Privileged account inventory",
        "AWS CloudTrail logs for admin actions",
        "Break-glass procedure documentation",
        "Physical safe access log for root credentials"
      ],
      "mappings": {
        "SOC 2": ["CC6.2", "CC6.8"],
        "GDPR": ["Art 32"]
      }
    },
    "DAT-01": {
      "id": "DAT-01",
      "category": "Data Protection",
      "title": "Data Classification",
      "description": "All data is classified as Public, Internal, Confidential, or Restricted. Handling requirements are defined for each classification level.",
      "objective": "Ensure appropriate protection based on data sensitivity.",
      "implementation": [
        "**Classification Levels**: Public (marketing), Internal (business docs), Confidential (customer PII), Restricted (payment data, PHI).",
        "**Labeling**: Sensitive data stored in dedicated S3 buckets/RDS databases with classification tags.",
        "**Handling Rules**: Restricted data requires encryption at rest and in transit. Access logged and monitored. Cannot be stored on endpoints.",
        "**Training**: Annual data classification training for all employees."
      ],
      "examples": [
        "Customer PII stored in S3 bucket tagged 'DataClassification=Confidential'",
        "No Restricted or Confidential data permitted in Slack or email",
        "Source code classified as Internal, deployed apps handle Confidential customer data",
        "Marketing materials classified as Public, customer contracts as Confidential"
      ],
      "audit_evidence": [
        "Data classification policy",
        "AWS resource tags showing classifications",
        "Training completion records",
        "Data inventory with classifications"
      ],
      "mappings": {
        "SOC 2": ["CC6.6", "CC6.7"],
        "GDPR": ["Art 32"]
      }
    },
    "DAT-02": {
      "id": "DAT-02",
      "category": "Data Protection",
      "title": "Encryption",
      "description": "All data is encrypted in transit using TLS 1.2+. Sensitive data is encrypted at rest using AES-256. Encryption keys are managed through AWS KMS.",
      "objective": "Protect data confidentiality through cryptographic controls.",
      "implementation": [
        "**In Transit**: All external APIs use HTTPS with TLS 1.2+. Internal services use TLS for inter-service communication. No plaintext protocols.",
        "**At Rest**: S3 buckets use SSE-KMS encryption. RDS databases use encryption at rest. EBS volumes encrypted.",
        "**Key Management**: AWS KMS for encryption keys. Keys rotated annually. Access to keys controlled via IAM.",
        "**Endpoints**: macOS FileVault full disk encryption required on all employee devices."
      ],
      "examples": [
        "All S3 buckets have default encryption enabled with AWS KMS",
        "RDS instances configured with encryption at rest using customer managed KMS keys",
        "Application enforces TLS 1.2 minimum, TLS 1.0/1.1 disabled",
        "All employee MacBooks have FileVault enabled and verified quarterly"
      ],
      "audit_evidence": [
        "S3 bucket encryption settings",
        "RDS encryption configuration",
        "TLS configuration for load balancers/applications",
        "MDM reports showing FileVault status on all devices"
      ],
      "mappings": {
        "SOC 2": ["CC6.1", "CC6.7"],
        "GDPR": ["Art 32"]
      }
    },
    "DAT-03": {
      "id": "DAT-03",
      "category": "Data Protection",
      "title": "Data Retention & Deletion",
      "description": "Data is retained according to policy and legal requirements. Data is securely deleted when no longer needed. Customers can request deletion of their data.",
      "objective": "Minimize data retention and enable secure deletion.",
      "implementation": [
        "**Retention Policy**: Application logs retained 90 days. Audit logs retained 7 years. Customer data retained per contract + 90 days.",
        "**Automated Deletion**: S3 lifecycle policies automatically delete old data. Automated scripts clean up aged development/test data.",
        "**Customer Deletion**: API endpoint allows customers to request data deletion. Deletion completed within 30 days and confirmed.",
        "**Backup Retention**: Database backups retained 30 days, then deleted. Long-term archives encrypted and access-controlled."
      ],
      "examples": [
        "S3 lifecycle policy deletes CloudTrail logs older than 7 years",
        "Customer data deletion requests processed via ticketing system with audit trail",
        "Development environments automatically wipe test data after 90 days",
        "Deleted customer data verified absent from all systems including backups"
      ],
      "audit_evidence": [
        "Data retention policy",
        "S3 lifecycle policies",
        "Customer deletion request logs",
        "Backup retention settings"
      ],
      "mappings": {
        "SOC 2": ["CC6.5"],
        "GDPR": ["Art 5", "Art 17"]
      }
    },
    "DAT-04": {
      "id": "DAT-04",
      "category": "Data Protection",
      "title": "Data Privacy (GDPR Compliance)",
      "description": "Customer data is processed according to GDPR requirements. Privacy rights are respected including access, portability, and deletion. Data Processing Agreements are in place with vendors.",
      "objective": "Ensure GDPR compliance and respect customer privacy rights.",
      "implementation": [
        "**Legal Basis**: Document legal basis for processing (contract, consent, legitimate interest). Obtain consent where required.",
        "**Privacy Rights**: Process customer requests for data access, portability, deletion within 30 days. Maintain request log.",
        "**DPAs**: Execute Data Processing Agreements with all vendors processing customer data. Maintain DPA register.",
        "**Privacy by Design**: Conduct privacy assessments for new features. Minimize data collection to what's necessary."
      ],
      "examples": [
        "Customer can download all their data via account settings (portability)",
        "Privacy team reviews all new features that collect/process customer data",
        "DPAs signed with AWS, Google Workspace, support ticketing system",
        "Data processing inventory documents purpose and legal basis for all customer data"
      ],
      "audit_evidence": [
        "Privacy policy",
        "Customer rights request log",
        "DPA register with all vendors",
        "Privacy assessment documentation"
      ],
      "mappings": {
        "SOC 2": ["CC6.6", "CC6.7"],
        "GDPR": ["Art 5", "Art 6", "Art 15", "Art 17", "Art 20", "Art 28", "Art 32"]
      }
    },
    "INF-01": {
      "id": "INF-01",
      "category": "Infrastructure Security",
      "title": "Cloud Security Configuration (AWS)",
      "description": "AWS infrastructure follows security best practices. Security Groups, NACLs, and IAM policies are configured with least privilege. Infrastructure as Code is used for consistent secure configurations.",
      "objective": "Maintain secure AWS infrastructure configuration.",
      "implementation": [
        "**Network Segmentation**: Production VPC separate from development. Public subnets for load balancers, private subnets for application/database.",
        "**Security Groups**: Default deny all inbound. Explicit allow rules for necessary traffic. No 0.0.0.0/0 for sensitive ports.",
        "**Infrastructure as Code**: Terraform for all infrastructure. Peer review required. Terraform state in encrypted S3 with DynamoDB locking.",
        "**AWS Config**: Enabled in all regions. Rules check for security misconfigurations (unencrypted resources, public S3 buckets, etc.)."
      ],
      "examples": [
        "Production RDS databases in private subnet, not internet-accessible",
        "Security groups allow only necessary ports (443 for HTTPS, 5432 for Postgres)",
        "AWS Config rule alerts when S3 bucket becomes public",
        "All infrastructure changes require Terraform PR with security review"
      ],
      "audit_evidence": [
        "Network architecture diagram",
        "Terraform code repository",
        "AWS Config compliance dashboard",
        "Security group rules audit"
      ],
      "mappings": {
        "SOC 2": ["CC6.6", "CC7.2"],
        "GDPR": ["Art 32"]
      }
    },
    "INF-02": {
      "id": "INF-02",
      "category": "Infrastructure Security",
      "title": "Network Security",
      "description": "Network boundaries are protected with firewalls and network segmentation. Remote access requires VPN or zero-trust architecture. Network traffic is monitored.",
      "objective": "Protect network perimeter and internal network traffic.",
      "implementation": [
        "**Cloud Firewalls**: AWS Security Groups and NACLs protect resources. AWS Network Firewall for advanced threat protection.",
        "**Zero Trust**: Applications behind AWS Application Load Balancer with WAF. No direct internet access to application servers.",
        "**Remote Access**: No VPN - all remote access via SSO to cloud applications. Engineers access AWS Console via SSO only.",
        "**Traffic Monitoring**: VPC Flow Logs enabled. AWS GuardDuty for threat detection. Unusual traffic patterns trigger alerts."
      ],
      "examples": [
        "All application servers in private subnets with no public IP addresses",
        "AWS WAF protects APIs from common attacks (SQL injection, XSS)",
        "VPC Flow Logs sent to CloudWatch, analyzed for anomalies",
        "GuardDuty alerts on suspicious network activity (port scanning, crypto mining)"
      ],
      "audit_evidence": [
        "Network diagram showing segmentation",
        "VPC Flow Logs configuration",
        "AWS GuardDuty findings report",
        "WAF rules and blocked request metrics"
      ],
      "mappings": {
        "SOC 2": ["CC6.6", "CC6.7"],
        "GDPR": ["Art 32"]
      }
    },
    "INF-03": {
      "id": "INF-03",
      "category": "Infrastructure Security",
      "title": "Logging & Monitoring",
      "description": "Security events and system activities are logged centrally. Logs are monitored for anomalies and security incidents. Logs are retained and protected from tampering.",
      "objective": "Enable security incident detection and investigation through comprehensive logging.",
      "implementation": [
        "**Centralized Logging**: All AWS CloudTrail, VPC Flow Logs, application logs sent to CloudWatch Logs. Immutable storage in S3.",
        "**Security Monitoring**: AWS GuardDuty for threat detection. CloudWatch alarms for critical events (root account usage, unauthorized API calls).",
        "**Alerting**: PagerDuty integration for security alerts. P0/P1 alerts page on-call engineer 24/7.",
        "**Log Retention**: Security logs retained 7 years. Application logs 90 days. Logs encrypted and access-controlled."
      ],
      "examples": [
        "CloudTrail logs every AWS API call across all regions to immutable S3 bucket",
        "Failed authentication attempts trigger alert after 5 failures in 5 minutes",
        "GuardDuty detected and alerted on compromised EC2 instance (bitcoin mining)",
        "Security team can search all logs in CloudWatch Insights for investigation"
      ],
      "audit_evidence": [
        "CloudTrail configuration showing all regions enabled",
        "CloudWatch alarm definitions",
        "PagerDuty integration and alert history",
        "Log retention policy and S3 lifecycle configuration"
      ],
      "mappings": {
        "SOC 2": ["CC7.2", "CC7.3"],
        "GDPR": ["Art 32"]
      }
    },
    "INF-04": {
      "id": "INF-04",
      "category": "Infrastructure Security",
      "title": "Backup & Recovery",
      "description": "Critical systems and data are backed up regularly. Backups are encrypted and tested. Disaster recovery procedures are documented and tested annually.",
      "objective": "Ensure business continuity through reliable backup and recovery capabilities.",
      "implementation": [
        "**Database Backups**: RDS automated backups daily with 30-day retention. Manual snapshots before major changes.",
        "**Infrastructure Backups**: Terraform state backed up. AMI snapshots of critical EC2 instances. S3 versioning enabled for application data.",
        "**Backup Testing**: Quarterly restore test from backup to verify recovery. Document restore time and success.",
        "**DR Plan**: Written disaster recovery plan tested annually. Defines RTO (4 hours) and RPO (1 hour) targets."
      ],
      "examples": [
        "RDS production database has automated daily backups retained 30 days",
        "Q4 2024 backup restore test successfully restored production database in 45 minutes",
        "S3 versioning enabled on all production buckets with MFA delete protection",
        "Annual DR tabletop exercise completed with documented findings"
      ],
      "audit_evidence": [
        "Backup configuration showing schedule and retention",
        "Quarterly backup restore test results",
        "Disaster recovery plan document",
        "Annual DR exercise documentation"
      ],
      "mappings": {
        "SOC 2": ["CC9.1", "A1.2"],
        "GDPR": ["Art 32"]
      }
    },
    "END-01": {
      "id": "END-01",
      "category": "Endpoint Security",
      "title": "Device Management (macOS MDM)",
      "description": "All employee devices are managed through MDM. Security policies are enforced including disk encryption, screen lock, and automatic updates. Lost devices can be remotely wiped.",
      "objective": "Secure employee endpoints through centralized management.",
      "implementation": [
        "**MDM Solution**: Jamf Pro or Kandji for Mac management. All devices enrolled before provision to employee.",
        "**Required Policies**: FileVault enabled, screen lock after 5 minutes, automatic updates enabled, malware protection installed.",
        "**Compliance Monitoring**: MDM dashboard shows device compliance. Non-compliant devices flagged and user notified.",
        "**Remote Wipe**: Lost or stolen device remotely wiped via MDM. Terminated employee devices wiped within 1 hour."
      ],
      "examples": [
        "100% of employee Macs enrolled in Jamf with FileVault enabled",
        "MDM enforces automatic macOS security updates within 7 days of release",
        "Lost laptop remotely wiped within 2 hours of employee report",
        "Non-compliant device blocked from network access until remediated"
      ],
      "audit_evidence": [
        "MDM enrollment report showing all devices",
        "Device compliance dashboard",
        "Remote wipe logs",
        "MDM policy configuration"
      ],
      "mappings": {
        "SOC 2": ["CC6.6", "CC6.7"],
        "GDPR": ["Art 32"]
      }
    },
    "END-02": {
      "id": "END-02",
      "category": "Endpoint Security",
      "title": "Endpoint Protection",
      "description": "All endpoints run antivirus/anti-malware software. Full disk encryption is enabled. Endpoint detection and response (EDR) capabilities are deployed.",
      "objective": "Protect endpoints from malware and data loss.",
      "implementation": [
        "**Antivirus**: macOS built-in XProtect supplemented with CrowdStrike or SentinelOne for enhanced threat detection.",
        "**Full Disk Encryption**: FileVault required on all Mac devices. Verified via MDM. Recovery keys escrowed to MDM.",
        "**EDR**: CrowdStrike Falcon or SentinelOne for behavioral detection, threat hunting, and response.",
        "**USB Restrictions**: USB storage blocked via MDM policy. Approved devices (Yubikey) allow-listed."
      ],
      "examples": [
        "CrowdStrike deployed on all employee Macs with real-time protection",
        "FileVault enabled on 100% of devices, verified weekly via MDM report",
        "USB storage devices blocked - attempted use generates security alert",
        "CrowdStrike detected and quarantined malware from phishing email attachment"
      ],
      "audit_evidence": [
        "Antivirus deployment status",
        "FileVault encryption status from MDM",
        "EDR agent deployment report",
        "Malware detection and remediation logs"
      ],
      "mappings": {
        "SOC 2": ["CC6.8", "CC7.2"],
        "GDPR": ["Art 32"]
      }
    },
    "END-03": {
      "id": "END-03",
      "category": "Endpoint Security",
      "title": "Software Updates",
      "description": "Operating systems and applications are kept up to date with security patches. Critical security updates are applied within 7 days. Patch status is monitored.",
      "objective": "Reduce vulnerability exposure through timely patching.",
      "implementation": [
        "**Automatic Updates**: MDM policy enables automatic macOS security updates. Users cannot disable.",
        "**Patch Schedule**: Critical security patches applied within 7 days. Other updates within 30 days.",
        "**Application Updates**: Homebrew or automatic updaters for development tools. Security-critical apps (browsers) auto-update.",
        "**Monitoring**: MDM dashboard shows OS version for all devices. Outdated devices flagged and users notified."
      ],
      "examples": [
        "95% of employee Macs on latest macOS version within 30 days of release",
        "Critical macOS security update deployed to all devices within 5 days",
        "Chrome browser automatically updates to latest version within 24 hours",
        "MDM report shows zero devices more than 60 days behind on patches"
      ],
      "audit_evidence": [
        "MDM update policy configuration",
        "Device OS version report",
        "Patch deployment timeline for recent critical updates",
        "Update compliance dashboard"
      ],
      "mappings": {
        "SOC 2": ["CC7.1", "CC8.1"],
        "GDPR": ["Art 32"]
      }
    },
    "OPS-01": {
      "id": "OPS-01",
      "category": "Operational Security",
      "title": "Change Management",
      "description": "Changes to production systems follow a defined process. Changes are reviewed, tested, and approved. Emergency changes are documented after the fact. Rollback procedures are in place.",
      "objective": "Minimize risk from production changes through controlled processes.",
      "implementation": [
        "**Change Process**: All production changes require GitHub pull request with peer review. Terraform changes require approval from senior engineer.",
        "**Testing**: Changes deployed to staging environment first. Automated tests must pass. Manual QA sign-off for risky changes.",
        "**Change Window**: Standard changes deployed during business hours. High-risk changes during maintenance window with customer notice.",
        "**Emergency Changes**: Allowed for critical security/availability issues. Post-mortem required within 48 hours."
      ],
      "examples": [
        "All infrastructure changes require Terraform PR with two approvals",
        "Application deployed to staging, passes automated tests, then promoted to production",
        "Database schema change tested in staging, deployed during maintenance window",
        "Emergency patch deployed for critical vulnerability, post-mortem completed next day"
      ],
      "audit_evidence": [
        "Change management procedure",
        "GitHub pull request history showing reviews and approvals",
        "Deployment logs with timestamps",
        "Emergency change post-mortems"
      ],
      "mappings": {
        "SOC 2": ["CC8.1"],
        "GDPR": ["Art 32"]
      }
    },
    "OPS-02": {
      "id": "OPS-02",
      "category": "Operational Security",
      "title": "Vulnerability Management",
      "description": "Systems are regularly scanned for vulnerabilities. Critical vulnerabilities are patched within 30 days. Penetration testing is conducted annually. Vulnerability management process is documented.",
      "objective": "Identify and remediate security vulnerabilities before exploitation.",
      "implementation": [
        "**Vulnerability Scanning**: AWS Inspector scans EC2 instances and containers for vulnerabilities. Dependency scanning in GitHub for application code.",
        "**Patching SLA**: Critical vulnerabilities patched within 7 days. High within 30 days. Medium within 90 days.",
        "**Penetration Testing**: Annual external penetration test by qualified third party. Findings remediated based on severity.",
        "**Bug Bounty**: Public bug bounty program for security researchers. Valid findings remediated and researcher rewarded."
      ],
      "examples": [
        "AWS Inspector scans all production EC2 instances weekly",
        "Dependabot creates PRs for vulnerable npm packages, merged within 5 days",
        "2024 annual penetration test found 2 medium findings, both remediated within 30 days",
        "Bug bounty program paid out 3 researchers in 2024 for valid security findings"
      ],
      "audit_evidence": [
        "Vulnerability scan results",
        "Vulnerability remediation timeline",
        "Annual penetration test report",
        "Bug bounty program results"
      ],
      "mappings": {
        "SOC 2": ["CC7.1"],
        "GDPR": ["Art 32"]
      }
    },
    "OPS-03": {
      "id": "OPS-03",
      "category": "Operational Security",
      "title": "Incident Response",
      "description": "Security incident response procedures are documented and tested. Incidents are detected, contained, and remediated. Post-incident reviews are conducted. Incidents are reported as required by regulation.",
      "objective": "Respond effectively to security incidents and minimize impact.",
      "implementation": [
        "**Detection**: AWS GuardDuty, CloudWatch alarms, CrowdStrike EDR generate alerts. Employee reporting via security@company.com.",
        "**Response Process**: Incident severity classification (P0-P3). On-call engineer paged for P0/P1. Incident commander assigned. War room (Slack/Zoom).",
        "**Containment**: Isolate affected systems. Revoke compromised credentials. Preserve evidence for investigation.",
        "**Post-Incident**: Post-incident review (PIR) within 5 days for P0/P1. Document findings, root cause, action items. Track remediation."
      ],
      "examples": [
        "GuardDuty detected compromised EC2 instance, paged on-call, instance isolated within 15 minutes",
        "Phishing email reported by employee, security team investigated and blocked sender",
        "Quarterly tabletop exercise practiced ransomware response",
        "2024: 12 security incidents, all with completed PIRs and remediation action items"
      ],
      "audit_evidence": [
        "Incident response policy and runbooks",
        "Incident log with severity, timeline, resolution",
        "Post-incident review documents",
        "Tabletop exercise documentation"
      ],
      "mappings": {
        "SOC 2": ["CC7.3", "CC7.4", "CC7.5"],
        "GDPR": ["Art 33", "Art 34"]
      }
    },
    "OPS-04": {
      "id": "OPS-04",
      "category": "Operational Security",
      "title": "Business Continuity",
      "description": "Business continuity and disaster recovery plans are documented and tested. Critical systems have defined RTO and RPO. Failover procedures are tested. Alternative processing sites are available.",
      "objective": "Ensure business operations can continue during disruptions.",
      "implementation": [
        "**BC/DR Plan**: Written plan covering key scenarios (data center outage, natural disaster, cyber attack). Roles and responsibilities defined.",
        "**RTO/RPO Targets**: Production database RTO 4 hours, RPO 1 hour. Application servers RTO 2 hours (auto-scaling).",
        "**AWS Multi-Region**: Critical services can failover to alternate AWS region. Route53 health checks enable automatic failover.",
        "**Annual Testing**: BC/DR plan tested annually via tabletop or live failover exercise. Plan updated based on findings."
      ],
      "examples": [
        "Production database has multi-AZ deployment with automatic failover",
        "Route53 configured to failover to us-west-2 if us-east-1 unhealthy",
        "Annual DR test failed over production to alternate region, verified RTO target met",
        "Communications plan includes customer notification templates for major outages"
      ],
      "audit_evidence": [
        "Business continuity plan",
        "RTO/RPO definitions for critical systems",
        "Annual BC/DR test results",
        "Multi-region architecture diagram"
      ],
      "mappings": {
        "SOC 2": ["A1.1", "A1.2", "A1.3"],
        "GDPR": ["Art 32"]
      }
    },
    "PEO-01": {
      "id": "PEO-01",
      "category": "People Security",
      "title": "Background Checks",
      "description": "Background checks are conducted on all employees before hire. Checks are appropriate for role and comply with local laws. Contractors with access to sensitive data also undergo checks.",
      "objective": "Reduce insider threat risk through pre-employment screening.",
      "implementation": [
        "**All Employees**: Criminal background check conducted by third-party service before start date. Education and employment verification.",
        "**Sensitive Roles**: Finance and security roles undergo credit check and additional screening.",
        "**International**: Background checks comply with local laws (GDPR consent in EU).",
        "**Contractors**: Contractors with production access or handling customer data undergo same background check as employees."
      ],
      "examples": [
        "100% of employees hired in 2024 completed background check before start date",
        "Background check vendor provides compliant checks in US, EU, Canada",
        "Contractor with production database access required to pass background check",
        "Failed background check resulted in offer rescission per policy"
      ],
      "audit_evidence": [
        "Background check policy",
        "Background check completion records for all employees",
        "Vendor agreement with background check provider",
        "Contractor screening documentation"
      ],
      "mappings": {
        "SOC 2": ["CC1.4"],
        "GDPR": ["Art 88"]
      }
    },
    "PEO-02": {
      "id": "PEO-02",
      "category": "People Security",
      "title": "Security Training",
      "description": "All employees complete security awareness training upon hire and annually. Training covers phishing, password security, data handling, and incident reporting. Phishing simulations test effectiveness.",
      "objective": "Build security awareness culture and reduce human-factor risks.",
      "implementation": [
        "**Onboarding Training**: New hires complete security training in first week. Covers acceptable use, data classification, password policy, phishing.",
        "**Annual Training**: All employees complete annual security training. Updated for current threats. Completion tracked in LMS.",
        "**Phishing Simulations**: Quarterly simulated phishing campaigns. Employees who click get remedial training. Track click rate over time.",
        "**Role-Specific**: Engineers get additional training on secure coding, OWASP Top 10. Support team trained on handling customer data."
      ],
      "examples": [
        "2024: 100% of employees completed annual security training",
        "Q4 2024 phishing simulation: 5% click rate (down from 15% in Q1)",
        "Engineering team completed secure coding training covering SQL injection, XSS",
        "New hire security training includes hands-on WebAuthn setup"
      ],
      "audit_evidence": [
        "Security training curriculum",
        "Training completion reports",
        "Phishing simulation results",
        "Role-specific training records"
      ],
      "mappings": {
        "SOC 2": ["CC1.4", "CC2.2"],
        "GDPR": ["Art 32"]
      }
    },
    "PEO-03": {
      "id": "PEO-03",
      "category": "People Security",
      "title": "Offboarding",
      "description": "Access is revoked immediately upon termination. Company property is returned. Exit interviews cover confidentiality and data handling obligations. Terminated employee accounts are monitored.",
      "objective": "Protect company assets during employee departure.",
      "implementation": [
        "**Immediate Access Revocation**: HR notifies IT of termination. SCIM automatically disables SSO account within 1 hour. AWS, GitHub, other access removed.",
        "**Property Return**: Employee returns laptop, Yubikey, badges. Equipment wiped and returned to inventory.",
        "**Exit Process**: Manager and HR complete offboarding checklist. Exit interview covers non-disclosure agreement and return of confidential data.",
        "**Monitoring**: Terminated employee accounts monitored for 30 days for attempted access. Alerts escalated to security team."
      ],
      "examples": [
        "Terminated employee account disabled in Okta within 30 minutes of HR notification",
        "Returned MacBook wiped via MDM remote wipe command, FileVault recovery key used",
        "Exit interview checklist completed for all voluntary and involuntary terminations",
        "Attempted login by terminated employee blocked and security team notified"
      ],
      "audit_evidence": [
        "Offboarding procedure",
        "Termination and access revocation logs",
        "Exit interview documentation",
        "Equipment return records"
      ],
      "mappings": {
        "SOC 2": ["CC6.3"],
        "GDPR": ["Art 32"]
      }
    },
    "VEN-01": {
      "id": "VEN-01",
      "category": "Vendor Management",
      "title": "Third-Party Risk Assessment",
      "description": "Vendors with access to systems or data undergo security assessment. High-risk vendors complete security questionnaire. Security requirements are included in vendor contracts.",
      "objective": "Manage security risks from third-party relationships.",
      "implementation": [
        "**Vendor Classification**: Vendors classified by risk level based on data access and criticality. High-risk vendors require detailed assessment.",
        "**Security Questionnaire**: High-risk vendors complete security questionnaire (SIG Lite or custom). Review responses for red flags.",
        "**Contract Requirements**: Vendor contracts include security requirements, audit rights, data handling obligations, breach notification.",
        "**Annual Review**: High-risk vendor security posture reviewed annually. Request updated documentation (SOC 2, ISO 27001, pentests)."
      ],
      "examples": [
        "AWS, GitHub, Okta classified as high-risk, annual SOC 2 reports reviewed",
        "New payment processor completed security questionnaire, passed review",
        "Vendor contracts include 72-hour breach notification requirement",
        "Annual vendor security reviews completed Q1 2024 for all high-risk vendors"
      ],
      "audit_evidence": [
        "Vendor risk assessment procedure",
        "Vendor inventory with risk classifications",
        "Completed security questionnaires",
        "Vendor SOC 2 / ISO 27001 reports"
      ],
      "mappings": {
        "SOC 2": ["CC9.2"],
        "GDPR": ["Art 28"]
      }
    },
    "VEN-02": {
      "id": "VEN-02",
      "category": "Vendor Management",
      "title": "Vendor Contracts & DPAs",
      "description": "Vendor contracts include security, privacy, and compliance requirements. Data Processing Agreements (DPAs) are executed with vendors processing customer data. Vendor compliance is monitored.",
      "objective": "Ensure vendors meet security and privacy obligations through contractual controls.",
      "implementation": [
        "**Contract Requirements**: All vendor contracts reviewed by legal and security. Include security standards, SLA, audit rights, termination clause.",
        "**DPAs**: DPAs executed with any vendor processing customer personal data (GDPR requirement). Standard DPA template approved by legal.",
        "**SLA Monitoring**: Monitor vendor SLAs for availability, incident notification, data deletion. Escalate breaches to vendor management.",
        "**Contract Repository**: Central repository (DocuSign, Ironclad) for vendor contracts and DPAs. Track expiration and renewal dates."
      ],
      "examples": [
        "AWS DPA executed and covers all regions where customer data resides",
        "Support ticketing system vendor signed DPA before handling customer PII",
        "Contract repository shows 100% of high-risk vendors have executed DPAs",
        "Vendor missed SLA for incident notification, escalated and process improved"
      ],
      "audit_evidence": [
        "Vendor contract templates",
        "DPA template and executed DPAs",
        "Contract repository/register",
        "SLA monitoring and escalation records"
      ],
      "mappings": {
        "SOC 2": ["CC9.2"],
        "GDPR": ["Art 28"]
      }
    },
    "GOV-01": {
      "id": "GOV-01",
      "category": "Governance",
      "title": "Security Policies",
      "description": "Security policies are documented, approved by leadership, and communicated to employees. Policies are reviewed annually and updated as needed. Employee acknowledgment is tracked.",
      "objective": "Establish governance framework for security program.",
      "implementation": [
        "**Policy Framework**: Written policies cover all security domains (access control, encryption, incident response, etc.). Policies approved by CEO/CTO.",
        "**Communication**: Policies published in employee handbook and internal wiki. New hires acknowledge policies during onboarding.",
        "**Annual Review**: Policies reviewed annually by security team and updated for changes in risk, regulations, technology.",
        "**Acknowledgment**: Employees acknowledge security policies annually. Track completion in HR system."
      ],
      "examples": [
        "Security policy framework covers 15 domains aligned to SOC 2 and GDPR",
        "CEO approved updated incident response policy in January 2024",
        "100% of employees acknowledged security policies in 2024",
        "Annual policy review completed Q4 2023, resulted in updates to data classification policy"
      ],
      "audit_evidence": [
        "Complete security policy documentation",
        "Policy approval records",
        "Employee acknowledgment reports",
        "Annual policy review meeting minutes"
      ],
      "mappings": {
        "SOC 2": ["CC1.1", "CC1.2", "CC2.1"],
        "GDPR": ["Art 24", "Art 32"]
      }
    },
    "GOV-02": {
      "id": "GOV-02",
      "category": "Governance",
      "title": "Risk Assessment",
      "description": "Security risk assessments are conducted annually. Risks are identified, evaluated, and prioritized. Risk treatment plans are developed and tracked. Executive leadership is informed of risk status.",
      "objective": "Identify and manage security risks to the organization.",
      "implementation": [
        "**Annual Risk Assessment**: Formal risk assessment conducted annually. Identify threats, vulnerabilities, likelihood, impact.",
        "**Risk Register**: Maintain risk register with identified risks, risk ratings, treatment plans, owners.",
        "**Risk Treatment**: For each risk, document treatment (mitigate, accept, transfer, avoid). Track remediation actions.",
        "**Executive Reporting**: Present risk assessment results to executive team. High/critical risks require executive acceptance or funding for mitigation."
      ],
      "examples": [
        "2024 annual risk assessment identified 15 risks, 3 high, 12 medium",
        "High risk: No multi-region DR - approved budget for multi-region deployment in Q1 2025",
        "Risk register tracks 15 open risks, 8 with active remediation",
        "Quarterly risk status briefing to CEO and board"
      ],
      "audit_evidence": [
        "Risk assessment methodology",
        "Risk register with current risks",
        "Risk treatment plans and remediation status",
        "Executive presentation and approval records"
      ],
      "mappings": {
        "SOC 2": ["CC3.1", "CC3.2", "CC3.4"],
        "GDPR": ["Art 32"]
      }
    }
  }
}
